app/controllers/home_controller.rb

  def login

    if User.exists?(email: params[:user][:email], password: params[:user][:password])
      session[:user] = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mario@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "mario@gmail.com"], ["password", "mario"], ["LIMIT", 1]]

  def create
    user = User.new

    if params[:user][:password] != params[:user][:password_repeat]
      redirect_to controller: 'home', action: 'new', error_form: "Error: Password don't match"
      return
    end

    if User.exists?(email: params[:user][:email])
      redirect_to controller: 'home', action: 'new', error_form: "Error: Email is already used"
      return
    end

    user.name = params[:user][:name]
    user.email = params[:user][:email]
    user.password = params[:user][:password]

    user.save
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "pepe5@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pepe5"], ["email", "pepe5@gmail.com"], ["password", "pepe"], ["created_at", "2021-02-16 17:16:43.488745"], ["updated_at", "2021-02-16 17:16:43.488745"]]

  def dashboard
    if session[:user] == nil
      redirect_to "/"
    end

    @search_film = ""
    @film = ""
    @recent_movies = Film.order(:created_at).reverse_order.limit(4)
    @top_movies = Film.order(:imdbRating).reverse_order.limit(5)

    #random recomendation
    number_movies = rand(1..(Integer(Film.all.size)-1) )
---
SELECT "films".* FROM "films" ORDER BY "films"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT "films".* FROM "films" WHERE (imdbRating > 5.0)
SELECT "films".* FROM "films" WHERE (imdbRating > 5.0 and id > 12) LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "films"

  def description
    if session[:user] == nil
      redirect_to "/"
    end

    @film = ""
    @data = Film.find_by(id_film: params[:id])

    if ( @data == nil)
      @data = JSON.parse(RestClient.get('http://www.omdbapi.com/?i=' + params[:id] + '&apikey=25b46a1c'))
      # save on database
      film = Film.new
      film.id_film = params[:id]
      film.Title = @data['Title']
      film.Released = @data['Released']
      film.Year = @data['Year']
      film.Runtime = @data['Runtime']
      film.Genre = @data['Genre']
      film.Plot = @data['Plot']
      film.Country = @data['Country']
      film.Poster = @data['Poster']
      film.imdbRating = Float(@data['imdbRating'])
      film.save
    end

    #insert visit in log
    log = Log.find_by(email_user: session[:user]["email"], id_film: params[:id])
---
SELECT "films".* FROM "films" WHERE "films"."id_film" = ? LIMIT ?  [["id_film", "tt2011109"], ["LIMIT", 1]]
SELECT "films".* FROM "films" ORDER BY "films"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "films" ("Title", "Released", "Year", "Runtime", "Genre", "Plot", "Country", "Poster", "imdbRating", "created_at", "updated_at", "id_film") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "logs".* FROM "logs" WHERE "logs"."email_user" = ? AND "logs"."id_film" = ? LIMIT ?  [["email_user", "mario@gmail.com"], ["id_film", "tt0120737"], ["LIMIT", 1]]

      log = Log.new
      log.email_user = session[:user]["email"]
      log.id_film = params[:id]
      log.save
    else
      log.update(updated_at: Time.now)
---
UPDATE "logs" SET "updated_at" = ? WHERE "logs"."id" = ?  [["updated_at", "2021-02-16 22:03:45.482825"], ["id", 4]]
INSERT INTO "logs" ("email_user", "id_film", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email_user", "mario@gmail.com"], ["id_film", "tt0120737"], ["created_at", "2021-02-16 22:00:32.530289"], ["updated_at", "2021-02-16 22:00:32.530289"]]
UPDATE "logs" SET "updated_at" = ? WHERE "logs"."id" = ?  [["updated_at", "2021-02-16 22:12:21.794906"], ["id", 6]]

  def historical
    @last_movies = Film.joins('INNER JOIN logs ON films.id_film = logs.id_film').where('logs.email_user' => session[:user]["email"]).order('logs.updated_at desc').limit(20)
---
SELECT "films".* FROM "films" INNER JOIN logs ON films.id_film = logs.id_film WHERE "logs"."email_user" = ? ORDER BY logs.updated_at desc LIMIT ?  [["email_user", "mario@gmail.com"], ["LIMIT", 20]]